package com.tydic.unicom.crawler.service.interfaces;

import com.tydic.unicom.crawler.dao.interfaces.BaseDao;

public interface BaseServ<T> extends BaseDao<T> {
	// String json_main =
	// "{\"ordernum\":\"5651892673\",\"orderid\":\"8117032823571525\",\"姓名\":\"尹梦婷\",\"电话\":\"15223460919\",\"推广渠道\":\"自然订单\",\"context\":{\"0\":{\"商品\":\"微博V卡\"},\"1\":{\"号码\":\"17623105615(重庆)\",\"套餐\":\"微博V卡\"},\"2\":{\"姓名\":\"尹梦婷\",\"证件\":\"500227199810170029(18位身份证)\",\"地址\":\"重庆市璧山县璧城街道黄葛村1组128号\"},\"3\":{}},\"费用\":{\"商品金额总计\":\"0.00\",\"减免费用\":\"0.00\",\"运费\":\"0.00\",\"共需支付\":\"0.00\"},\"other\":{\"支付方式\":\"在线支付(全额支付)\",\"收货地址\":\"重庆，重庆市，璧山县，重庆市璧山区上海城A栋\",\"配送方式\":\"快递0元不限时间送货\",\"期望物流\":\"不限物流\"}}";
	//
	// ICrawlerSer cs = new CrawlerSerImpl();

}
